IDEA Open Model
MatConcreteEc2 Properties
Compatible with IDEA StatiCa v 10.1
The MatConcreteEc2 type exposes the following members.
Properties
Name | Description
AggregateType
 Type of aggregate
CalculateDependentValues
 Setting calculation dependent values on fck
CementClass
 Type of cement class
DiagramType
 Type of stress-strain diagram bilinear/parabolic/general for ULS calculation
E
 Young's modulus
 (Inherited from Material.)
Ecm
 Secant modulus of elasticity of concrete - Ecm
Epsc1
 Compressive strain in the concrete - εc1
Epsc2
 Compressive strain in the concrete - εc2
Epsc3
 Compressive strain in the concrete - εc3
Epscu1
 Ultimate compressive strain in the concrete - εcu1
Epscu2
 Ultimate compressive strain in the concrete - εcu2
Epscu3
 Ultimate compressive strain in the concrete - εcu3
Fck
 Characteristic compressive cylinder strength of concrete at 28 days - fck
Fcm
 Mean value of concrete cylinder compressive strength - fcm
Fctk_0_05
 Characteristic axial tensile strength of concrete 5% quantile - fctk,0,05
Fctk_0_95
 Characteristic axial tensile strength of concrete 95% quantile - fctk,0,95
Fctm
 Mean value of axial tensile strength of concrete - fctm
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
NFactor
 Coefficient n-factor - necessary parabolic part of stress-strain diagram - n
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
PlainConcreteDiagram
 Stress strain diagram with tension part
Poisson
 Poisson's ratio
 (Inherited from Material.)
SilicaFume
 Contains silica fume
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
StoneDiameter
 Diameter of stone
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
UnitMass
 Unit weight
 (Inherited from Material.)
UserDiagram
 Stress-strain diagram defined by user
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
MatConcreteEc2 Class
IdeaRS.OpenModel.Material Namespace